In [1]:
import pandas as pd

In [2]:
data_path = './data/ejercicio_2.csv'

In [3]:
info = pd.read_csv(data_path)

In [4]:
info.head(3)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Meta Nacional,Unnamed: 6,Unnamed: 7
0,NaN,NaN,Real,NaN,NaN,"185,000","203,500","223,850"
1,Vendedor,Potencial,ene-24,feb-24,mar-24,abr-24,may-24,jun-24
2,Vendedor 1,8048,"3,038","2,937","3,016",NaN,NaN,NaN

In [5]:
info.shape

(32, 8)

In [6]:
#seleccionamos la meta global
meta_q2 = info.iloc[0,5:]

In [7]:
meta_q2.info()

<class 'pandas.core.series.Series'>
Index: 3 entries, Meta Nacional to Unnamed: 7
Series name: 0
Non-Null Count  Dtype
--------------  -----
3 non-null      object
dtypes: object(1)
memory usage: 48.0+ bytes

In [8]:
meta_q2

Meta Nacional    185,000
Unnamed: 6       203,500
Unnamed: 7       223,850
Name: 0, dtype: object

In [9]:
del meta_q2

In [10]:
dataset = info.iloc[1:,:5]

In [11]:
dataset

     Unnamed: 0 Unnamed: 1 Unnamed: 2 Unnamed: 3 Unnamed: 4
1      Vendedor  Potencial     ene-24     feb-24     mar-24
2    Vendedor 1       8048      3,038      2,937      3,016
3    Vendedor 2       3211      8,915      8,903      9,007
4    Vendedor 3       9646      2,932      2,979      3,049
5    Vendedor 4       9617      2,870      2,941      3,054
6    Vendedor 5       3740      9,051      8,872      8,931
7    Vendedor 6       7514      3,007      3,015      2,911
8    Vendedor 7       2770      8,951      8,935      8,961
9    Vendedor 8       3613      6,074      5,926      6,079
10   Vendedor 9       8106      2,901      2,924      3,019
11  Vendedor 10       2902      8,947      9,065      9,134
12  Vendedor 11       3336      9,060      9,016      8,998
13  Vendedor 12       4351      5,888      6,030      6,002
14  Vendedor 13       4167      6,060      5,864      5,913
15  Vendedor 14       5403      3,071      2,945      3,006
16  Vendedor 15       6402      5,889      5,984      6,096
17  Vendedor 16       4228      5,933      5,963      5,960
18  Vendedor 17       5823      5,942      5,954      6,001
19  Vendedor 18       7338      2,956      2,998      2,957
20  Vendedor 19       3492      6,053      6,029      6,008
21  Vendedor 20       4603      5,922      6,020      5,934
22  Vendedor 21       2898      9,053      9,187      8,956
23  Vendedor 22       8069      2,960      3,056      3,004
24  Vendedor 23       2779      9,141      9,036      8,958
25  Vendedor 24       4253      3,048      2,908      3,082
26  Vendedor 25       2425      8,857      9,013      9,042
27  Vendedor 26       3489      5,960      6,034      6,035
28  Vendedor 27       3423      8,964      8,971      9,036
29  Vendedor 28       8872      2,999      3,036      2,979
30  Vendedor 29       4844      6,093      5,974      5,958
31  Vendedor 30       9828      3,032      2,916      3,003

In [12]:
columns=dataset.iloc[0]

In [17]:
cols_name= list(dict(columns).values())

In [16]:
cols_=list(dataset.columns)

In [18]:
dict(zip(cols_,cols_name))

{'Unnamed: 0': 'Vendedor',
 'Unnamed: 1': 'Potencial',
 'Unnamed: 2': 'ene-24',
 'Unnamed: 3': 'feb-24',
 'Unnamed: 4': 'mar-24'}

In [20]:
dataset.rename(columns=dict(zip(cols_,cols_name)),inplace=True)

In [22]:
dataset = dataset.iloc[1:,:5]

In [24]:
dataset.tail(3)

       Vendedor Potencial ene-24 feb-24 mar-24
29  Vendedor 28      8872  2,999  3,036  2,979
30  Vendedor 29      4844  6,093  5,974  5,958
31  Vendedor 30      9828  3,032  2,916  3,003